accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/accounts/GetAccount-Response.xml

 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetAccount">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetAccountResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:Mobile>
                  <!--Optional:-->
                  <get:MSISDN>?</get:MSISDN>
                  <!--Optional:-->
                  <get:Status>?</get:Status>
                  <!--Optional:-->
                  <get:RatePlan>?</get:RatePlan>
                  <!--Optional:-->
                  <get:RatePlanCode>?</get:RatePlanCode>
                  <!--Optional:-->
                  <get:ICCID>?</get:ICCID>
                  <!--Optional:-->
                  <get:StatusReason>?</get:StatusReason>
                  <!--Optional:-->
                  <get:ContractCode>?</get:ContractCode>
                  <!--Optional:-->
                  <get:BillingStatus>?</get:BillingStatus>
               </get:Mobile>
               <!--Optional:-->
               <get:Account>
                  <!--Optional:-->
                  <get:Id>?</get:Id>
                  <!--Optional:-->
                  <get:AccountCode>?</get:AccountCode>
                  <!--Optional:-->
                  <get:AccountName>?</get:AccountName>
                  <!--Optional:-->
                  <get:ArabicName>?</get:ArabicName>
                  <!--Optional:-->
                  <get:IntegrationId>?</get:IntegrationId>
                  <!--Optional:-->
                  <get:Segment>?</get:Segment>
                  <!--Optional:-->
                  <get:StreetName>?</get:StreetName>
                  <!--Optional:-->
                  <get:Unit>?</get:Unit>
                  <!--Optional:-->
                  <get:PO_BOX>?</get:PO_BOX>
                  <!--Optional:-->
                  <get:Area>?</get:Area>
                  <!--Optional:-->
                  <get:City>?</get:City>
                  <!--Optional:-->
                  <get:Emirate>?</get:Emirate>
                  <!--Optional:-->
                  <get:Country>?</get:Country>
                  <!--Optional:-->
                  <get:Email>?</get:Email>
                  <!--Optional:-->
                  <get:ContactId>?</get:ContactId>
                  <!--Optional:-->
                  <get:PhoneNumber>?</get:PhoneNumber>
                  <!--Optional:-->
                  <get:DateOfBirth>?</get:DateOfBirth>
                  <!--Optional:-->
                  <get:BillLanguage>?</get:BillLanguage>
                  <!--Optional:-->
                  <get:RecurringPayment>?</get:RecurringPayment>
                  <!--Optional:-->
                  <get:MonthlyIncome>?</get:MonthlyIncome>
                  <!--Optional:-->
                  <get:AlternativeContactNumber>?</get:AlternativeContactNumber>
                  <!--Optional:-->
                  <get:Status>?</get:Status>
                  <!--Optional:-->
                  <get:DeliverBill>?</get:DeliverBill>
                  <!--Optional:-->
                  <get:EstablishmentCard>?</get:EstablishmentCard>
                  <!--Optional:-->
                  <get:TradeLicense>?</get:TradeLicense>
                  <!--Optional:-->
                  <get:IssueDate>?</get:IssueDate>
                  <!--Optional:-->
                  <get:ExpiryDate>?</get:ExpiryDate>
                  <!--Optional:-->
                  <get:AccountManager>?</get:AccountManager>
                  <!--Optional:-->
                  <get:ContactNumber>?</get:ContactNumber>
                  <!--Optional:-->
                  <get:AccountManager2>?</get:AccountManager2>
                  <!--Optional:-->
                  <get:ContactNumber2>?</get:ContactNumber2>
                  <!--Optional:-->
                  <get:PaymentResponsibleFlag>?</get:PaymentResponsibleFlag>
                  <!--Optional:-->
                  <get:ContractResponsibleFlag>?</get:ContractResponsibleFlag>
                  <!--Optional:-->
                  <get:AccountType>?</get:AccountType>
                  <!--Optional:-->
                  <get:AccountLevel>?</get:AccountLevel>
                  <!--Optional:-->
                  <get:AccountLevelCode>?</get:AccountLevelCode>
                  <!--Optional:-->
                  <get:Nationality>?</get:Nationality>
                  <!--Optional:-->
                  <get:DocumentNumber>?</get:DocumentNumber>
                  <!--Optional:-->
                  <get:DocumentType>?</get:DocumentType>
                  <!--Optional:-->
                  <get:DocumentNumberIssueDate>?</get:DocumentNumberIssueDate>
                  <!--Optional:-->
                  <get:DocumentNumberExpiryDate>?</get:DocumentNumberExpiryDate>
                  <!--Optional:-->
                  <get:BillingProfile>
                     <!--Optional:-->
                     <get:PaymentMethod>?</get:PaymentMethod>
                     <!--Optional:-->
                     <get:CreditLimit>?</get:CreditLimit>
                     <!--Optional:-->
                     <get:BillingCycle>?</get:BillingCycle>
                     <!--Optional:-->
                     <get:BlacklistFlag>?</get:BlacklistFlag>
                     <!--Optional:-->
                     <get:PaymentResponsible>?</get:PaymentResponsible>
                     <!--Optional:-->
                     <get:EmailBillTo>?</get:EmailBillTo>
                  </get:BillingProfile>
                  <!--Optional:-->
                  <get:BillingContact>
                     <!--Optional:-->
                     <get:Title>?</get:Title>
                     <!--Optional:-->
                     <get:ArabicName>?</get:ArabicName>
                     <!--Optional:-->
                     <get:FullName>?</get:FullName>
                     <!--Optional:-->
                     <get:PreferedLanguage>?</get:PreferedLanguage>
                     <!--Optional:-->
                     <get:JobTitle>?</get:JobTitle>
                     <!--Optional:-->
                     <get:Departament>?</get:Departament>
                     <!--Optional:-->
                     <get:ContactMobileNumber>?</get:ContactMobileNumber>
                     <!--Optional:-->
                     <get:VisaType>?</get:VisaType>
                     <!--Optional:-->
                     <get:VisaExpiryDate>?</get:VisaExpiryDate>
                     <!--Optional:-->
                     <get:VisaNumber>?</get:VisaNumber>
                     <!--Optional:-->
                     <get:Gender>?</get:Gender>
                     <!--Optional:-->
                     <get:AbsherId>?</get:AbsherId>
                     <!--Optional:-->
                     <get:UnifiedNumber>?</get:UnifiedNumber>
                     <!--Optional:-->
                     <get:BillingFirstName>?</get:BillingFirstName>
                     <!--Optional:-->
                     <get:BillingLastName>?</get:BillingLastName>
                     <!--Optional:-->
                     <get:AccountFullName>?</get:AccountFullName>
                  </get:BillingContact>
                  <!--Optional:-->
                  <get:BillingAdress>
                     <!--Optional:-->
                     <get:StartDate>?</get:StartDate>
                     <!--Optional:-->
                     <get:BuildingName>?</get:BuildingName>
                     <!--Optional:-->
                     <get:BuildingNumber>?</get:BuildingNumber>
                     <!--Optional:-->
                     <get:FloorNumber>?</get:FloorNumber>
                  </get:BillingAdress>
                  <!--Optional:-->
                  <get:ShippingAdress>
                     <!--Optional:-->
                     <get:StreetName>?</get:StreetName>
                     <!--Optional:-->
                     <get:PO_BOX>?</get:PO_BOX>
                     <!--Optional:-->
                     <get:Emirate>?</get:Emirate>
                     <!--Optional:-->
                     <get:City>?</get:City>
                  </get:ShippingAdress>
               </get:Account>
               <!--Optional:-->
               <get:Customer>
                  <!--Optional:-->
                  <get:CustomerId>?</get:CustomerId>
                  <!--Optional:-->
                  <get:Name>?</get:Name>
                  <!--Optional:-->
                  <get:DocumentType>?</get:DocumentType>
                  <!--Optional:-->
                  <get:DocumentNumber>?</get:DocumentNumber>
                  <!--Optional:-->
                  <get:Nationality>?</get:Nationality>
                  <!--Optional:-->
                  <get:DocumentIssueDate>?</get:DocumentIssueDate>
                  <!--Optional:-->
                  <get:DocumentExpiryDate>?</get:DocumentExpiryDate>
                  <!--Optional:-->
                  <get:VisaType>?</get:VisaType>
                  <!--Optional:-->
                  <get:VisaExpiryDate>?</get:VisaExpiryDate>
                  <!--Optional:-->
                  <get:VisaNumber>?</get:VisaNumber>
                  <!--Optional:-->
                  <get:Gender>?</get:Gender>
                  <!--Optional:-->
                  <get:Language>?</get:Language>
                  <!--Optional:-->
                  <get:DateOfBirth>?</get:DateOfBirth>
                  <!--Optional:-->
                  <get:ContactId>?</get:ContactId>
                  <!--Optional:-->
                  <get:Title>?</get:Title>
                  <!--Optional:-->
                  <get:PreferredLanguage>?</get:PreferredLanguage>
                  <!--Optional:-->
                  <get:Type>?</get:Type>
                  <!--Optional:-->
                  <get:CompanyName>?</get:CompanyName>
               </get:Customer>
            </lcew:Body>
         </Response>
      </web:GetAccountResponse>
   </soapenv:Body>
</soapenv:Envelope>